# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [2]:
import pandas as pd

df = pd.read_csv("Purchase_Data.csv")
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [3]:
df.shape
df.columns

Index(['invoice_number', 'invoice_time', 'store_id', 'product_id',
       'category_id', 'num_item', 'price'],
      dtype='str')

Slice the first two columns using .loc and store the result in a variable called result_1.

In [4]:
result_1 = df.loc[:, df.columns[:2]]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [5]:
result_2 = df.loc[0:1, :]

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [6]:
result_3 = df.iloc[0:4, 0:5]

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [7]:
result_4 = df.loc[[0, 4, 6], ["invoice_time", "price"]]

Store the number rows in a variable called num_rows.

In [8]:

num_rows = df.shape[0]

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [9]:
df.iloc[num_rows - 1]

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [48]:
avg_price = df["price"].mean()
max_price = df["price"].max()
print(avg_price)
print(max_price)

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [49]:
avg_price, avg_num_items = df[["price", "num_item"]].mean()

Create a column called "total", which is the product of the price and num_item columns.

In [50]:
df["total"] = df["price"] * df["num_item"]

What is the avgerage price of the three most expensive purchases?

In [51]:
df.sort_values("price", ascending=False).head(3)["price"].mean()

np.float64(6.003333333333333)

How many different products are there?

In [52]:
df["product_id"].nunique()

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [53]:
desc = df["total"].describe()
difference = desc["mean"] - desc["50%"]
difference

np.float64(0.9318078781127839)

Use the drop() method to delete the column total from the dataframe df_data.

In [54]:
df = df.drop("total", axis=1)

Let's dig a little deeper into the data set and answer some basic question.

In [55]:
df["invoice_time"] = pd.to_datetime(df["invoice_time"])
df.dtypes

invoice_number           float64
invoice_time      datetime64[us]
store_id                     str
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [56]:
df["invoice_time"] = pd.to_datetime(df["invoice_time"])
df.dtypes

invoice_number           float64
invoice_time      datetime64[us]
store_id                     str
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [59]:
df["DOW"] = df["invoice_time"].dt.day_name()
df["Month"] = df["invoice_time"].dt.month

df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [60]:
num_purchases_wed = df["DOW"].value_counts()["Wednesday"]

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [37]:
df_titanic = pd.read_csv("Titanic.csv")
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [38]:
df_titanic = df_titanic.rename(
    columns={
        "Name": "Passenger_Name",
        "Ticket": "Ticket_Num"
    }
)

Change the index of the df_titanic to the column PasengerID.

In [39]:
df_titanic = df_titanic.set_index("PassengerId")

Select the name of passenger 896

In [41]:
df_titanic.loc[896, "Passenger_Name"]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [42]:
df_titanic = df_titanic.reset_index()

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [43]:
df_titanic["Age"].isnull().sum()

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [44]:
df_titanic["Age"].mean()

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [45]:
df_titanic["Age"] = df_titanic["Age"].fillna(df_titanic["Age"].mean())

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [47]:
df_titanic.sort_values("Age", ascending=False).head(5)["Age"].mean()

np.float64(67.0)